# Merge de los datos

In [1]:
# importamos nuestras librerias
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sbn

In [5]:
# llamamos nuestro csvm puede ser desde un servicio o desde un link como el siguiente
df1 = pd.read_csv("http://virtualfif.uaq.mx/diplomado/data/mark.csv")
df2 = pd.read_csv("http://virtualfif.uaq.mx/diplomado/data/student.csv")
print(df1.head(10))
print(df2.head(10))

   Student_id  Mark     City
0           1    95  Chennai
1           2    70    Delhi
2           3    98   Mumbai
3           4    75     Pune
4           5    89    Kochi
5           6    69  Gwalior
6           7    52   Bhopal
7           8    54  Chennai
8           9    55    Delhi
9          10    94   Mumbai
   Student_id  Age  Gender      Grade Employed
0           1   19    Male  1st Class      yes
1           2   20  Female  2nd Class       no
2           3   18    Male  1st Class       no
3           4   21  Female  2nd Class       no
4           5   19    Male  1st Class       no
5           6   20    Male  2nd Class      yes
6           7   19  Female  3rd Class      yes
7           8   21    Male  3rd Class      yes
8           9   22  Female  3rd Class      yes
9          10   21    Male  1st Class       no

In [6]:
df = pd.merge(df1,df2, on = 'Student_id')

In [7]:
df.head()

   Student_id  Mark     City  Age  Gender      Grade Employed
0           1    95  Chennai   19    Male  1st Class      yes
1           2    70    Delhi   20  Female  2nd Class       no
2           3    98   Mumbai   18    Male  1st Class       no
3           4    75     Pune   21  Female  2nd Class       no
4           5    89    Kochi   19    Male  1st Class       no